import jack from '../../assets/characters/jack.png';
import moon from '../../assets/characters/moonface.png';
import bunny from '../../assets/characters/bunny.png';
import sandy from '../../assets/characters/sandy.png';
import fairy from '../../assets/characters/fairy_queen.png';
import santa from '../../assets/characters/northman.png';
import pitch from '../../assets/characters/pitch.png';

export default {
  map: [
    {
      img: moon,
      title: 'Месяцетвары',
      text: 'Адчыняй вочы, Захавальнік!',
      answer: 'Эм.. Што?',
    },
    {
      img: moon,
      title: 'Месяцетвары',
      text:
        'Я даўно назіраў за тым, што адбываецца ў свеце, і цяпер, калі ўсё бурыцца на вачах, зямлі як ніколі патрэбен новы захавальнік. пі я выбраў цябе!',
      answer: 'Што за захавальнікі?',
    },
    {
      img: moon,
      title: 'Месяцетвары',
      text:
        'Захавальнікі-гэта абаронцы Зямлі. Кожны Захавальнік-майстар у сваёй справе. Напрыклад, Ледзяны джэк-валадар холаду і снегу, Зубная фея-захавальніца дзіцячых успамінаў, а пясочнік - творца сноў.',
      answer: 'I хто я?',
    },
    {
      img: moon,
      title: 'Месяцетвары',
      text:
        'На захавальнікаў напалі. Крамешнік-ўладыка цемры і страху адабраў у іх інструменты, без якіх яны - як без рук. Я выбраў Цябе за твой востры розум і знаходлівасць.пТы дапаможаш захавальнікам знайсці свае інструменты і адолець Крамешніка.',
      answer: 'Што мне рабіць?',
    },
    {
      img: moon,
      title: 'Месяцетвары',
      text:
        'Ляці да лабірынтах Велікоднага Труса. Ён заўсёды трымаў баявы дух і добрую форму, але без пэндзляў і фарбаў зусім страціў настрой.',
      answer: 'Добра',
    },
  ],
  0: [
    {
      img: bunny,
      title: 'Велікодны трусік ',
      text:
        'Здаровы! На Паўночным Полюсе пайшоў слых, што Месяцетвары абраў новага Захавальніка. Гэта ты?',
      answer: 'быццам бы так',
    },
    {
      img: pitch,
      title: 'Крамешнік',
      text:
        'Ух ты, да нас завітаў новы госць. Эй, Трус, можа ён знойдзе твае яйкі і фарбы?! Ха-ха!',
      answer: 'Навошта ты іх скраў?',
    },
    {
      img: pitch,
      title: 'Крамешнік',
      text:
        'Таму што людзі перасталі баяцца цемры! Я прывяду планету ў парадак! \nНаведу тут такі хаос, што страшна будзе спаць нават пры святле!',
      answer: 'Прычым тут трусік?',
    },
    {
      img: pitch,
      title: 'Крамешнік',
      text:
        'Вялікдзень-светлае свята, А маляўнічыя яйкі робяць людзей весялей... Ненавіджу ўсё гэта весялосьць!',
      answer: ' ... ',
    },
    {
      img: bunny,
      title: 'Велікодны трусік',
      text:
        'Гэй, новы захавальнік! Дапамажы мне знайсці мае фарбы, і мы вернем Вялікдзень людзям! Спадзяюся, пасля гэтага паспеем да пясочніцы на падмогу!',
      answer: 'Добра',
    },
  ],
  1: [
    {
      img: sandy,
      title: 'Пясочнік *размаўляе пясочнымі сімваламі*',
      text:
        'Прывітанне! Я-пясочнік, я насылаю добрыя сны людзям па ўсім свеце! Асабліва люблю ўвасабляць дзіцячыя мары ў снах!',
      answer: 'Прыемна пазнаёміцца!',
    },
    {
      img: sandy,
      title: 'Пясочнік *размаўляе пясочнымі сімваламі*',
      text:
        'Крамешнік скраў мае рэчы, а менавіта з іх я чэрпаю ідэі сноў. Без гэтых прадметаў не будзе яркіх і добрых сноў.',
      answer: 'Які жах!',
    },
    {
      img: bunny,
      title: 'Велікодны трусік',
      text:
        'Добра, пясочнік, не гаруй! Зараз мы пакажам гэтаму нягодніку, як у добрых істот рэчы красці!',
      answer: 'Пакажам!',
    },
  ],
  2: [
    {
      img: fairy,
      title: 'Зубная Фея',
      text: 'Крамешнік! Даю трыццаць секунд, каб ты вярнуў маіх памочніц.',
      answer: ' ... ',
    },
    {
      img: pitch,
      title: 'Крамешнік',
      text: 'Ці што? Манетку мне пакладзеш пад падушку? Ха-ха-ха!',
      answer: ' ... ',
    },
    {
      img: fairy,
      title: 'Зубная Фея',
      text:
        'Калі хоць адно крылца ў феечек памятаецца, я цябе вось гэтымі вось рукамі так адзначу, што родная мама не даведаецца!',
      answer: ' ... ',
    },
    {
      img: bunny,
      title: 'Велікодны трусік',
      text:
        'Ратуй памочніц Зубной феі, пакуль я буду дапамагаць ёй з Крамешніком!',
      answer: 'Добра',
    },
  ],
  3: [
    {
      img: fairy,
      title: 'Зубная Фея',
      text:
        'Ну і ў заварушку мы патрапілі! Звычайна я збірала дзіцячыя зубкі, а не выбівала дарослыя... але...\nСпасибо, што выратаваў маіх памочніц. Давай знойдзем ледзянога Джэка.',
      answer: 'Давай',
    },
    {
      img: jack,
      title: 'Ледзяны джэк',
      text:
        'Дзе ж ён?! Я нават буру без яго падняць не магу, не тое што лётаць!',
      answer: 'Джэк?',
    },
    {
      img: fairy,
      title: 'Зубная Фея',
      text: 'Джэк! Прывітанне, пазнаёмся з новым Захавальнікам!',
      answer: 'Прывітанне!',
    },
    {
      img: jack,
      title: 'Ледзяны джэк',
      text:
        'Прывітанне! Можа быць вы дапаможаце мне знайсці мой посах? Без яго я як без рук...',
      answer: ' ... ',
    },
    {
      img: fairy,
      title: 'Зубная Фея',
      text: 'Гэта Крамешнік яго скраў! Так, ён вярнуўся...',
      answer: 'Давайце пашукаем',
    },
  ],
  4: [
    {
      img: jack,
      title: 'Ледзяны джэк',
      text: 'Так-то! З кіем зусім іншая справа!',
      answer: 'Рады за цябе',
    },
    {
      img: pitch,
      title: 'Крамешнік',
      text:
        'Джэк, Джэк, Джэк... пМы маглі б столькі зрабіць разам, але ты адмовіўся! n варта было зламаць твой посах, таму што без яго ты жалю варты!',
      answer: 'Хопіць!',
    },
    {
      img: santa,
      title: 'Севяранін',
      text:
        'Ох ужо гэты Крамешнік! Жыць не можа без таго, каб кагосьці запалохаць! Яшчэ і еці маіх выкраў, а хто, калі не яны, будзе рабіць навагоднія цацкі?!',
      answer: 'Еці вялікія',
    },
    {
      img: santa,
      title: 'Севяранін',
      text:
        'Яны вялікія, але і схаваныя добра! Дапамажы знайсці маіх памочнікаў, каб мы паспелі зрабіць людзям свята!',
      answer: 'Добра',
    },
  ],
  5: [
    {
      img: santa,
      title: 'Севяранін',
      text: 'Мы ля самага логава Крамешніка!',
      answer: 'Дзіўныя коні...',
    },
    {
      img: sandy,
      title: 'Пясочнік *размаўляе пясочнымі сімваламі*',
      text:
        'Гэта не Коні... Гэта Кашмары! Некалі яны былі маімі снамі, але потым Крамешнік ачарніў іх!',
      answer: 'Жах!',
    },
    {
      img: fairy,
      title: 'Зубная Фея',
      text: 'Давайце з імі разбярэмся! У бой!',
      answer: 'Аааа!',
    },
  ],
  6: [
    {
      img: jack,
      title: 'Ледзяны джэк',
      text: 'Праз гэты туман нічога не відаць!',
      answer: 'Яшчэ і цёмна',
    },
    {
      img: fairy,
      title: 'Зубная Фея *крычыць*',
      text: 'Дзе вы?! Я вас не бачу!',
      answer: 'Ауу!',
    },
    {
      img: pitch,
      title: 'Крамешнік',
      text:
        'У апраметнай цемры баяцца-нармальна. І нічога не бачыць - таксама нармальна... \n але я вас бачу! І не баюся цемры! Паспрабуйце адолець мяне!',
      answer: 'Усе чагосьці баяцца!',
    },
  ],
  final: [
    {
      img: santa,
      title: 'Севяранін',
      text: 'Яго нават шкада! Дагналі ўласныя кашмары!',
      answer: 'Падзелам',
    },
    {
      img: bunny,
      title: 'Велікодны трусік',
      text: 'Спадзяюся, у свеце стане крышачку святлей! Ужо мы пастараемся!',
      answer: 'Упэўнены!',
    },
    {
      img: fairy,
      title: 'Зубная Фея',
      text: 'Дзякуй табе! Ты і праўда-новы захавальнік!',
      answer: 'Канец',
    },
  ],
};
